/* error message: kErrConv7To8_ConversionError */
"Could not convert song format." = "ไม่สามารถแปลงรูปแบบเพลงได้";

/* error message: kErrConv7To8_DamagedSong */
"This project seems to be damaged. Please restore from backup." = "ดูเหมือนโปรเจ็กต์นี้จะเสียหาย โปรดกู้คืนจากข้อมูลสำรอง";

/* error message: kErrConv7To8_NonReleaseLogicVersion */
"This project has been created with an intermediate non-release Logic version. It can't be opened any longer" = "โปรเจ็กต์นี้ถูกสร้างด้วย Logic เวอร์ชั่นกลางที่ไม่ได้เผยแพร่ออกมา ไม่สามารถเปิดต่อได้แล้ว";

/* error message: kErrConv7To8_PreLogic5Version - Message for High Sierra only */
"The song you are trying to open is in Logic 4 format (or earlier). Please open and save it with Logic 7.2.1 or earlier first.\n\nYou have to do that on a Macintosh computer, which still runs an older version of macOS, because these old versions of Logic Pro are no longer compatible with macOS 10.13 or later." = "เพลงที่คุณพยายามเปิดอยู่ในรูปแบบ Logic 4 (หรือก่อนหน้า) โปรดเปิดและบันทึกด้วย Logic 7.2.1 หรือก่อนหน้าก่อน\n\nคุณต้องทำสิ่งนี้บนคอมพิวเตอร์ Macintosh ซึ่งใช้ macOS เวอร์ชั่นที่เก่ากว่า เนื่องจาก Logic Pro เวอร์ชั่นเก่าเหล่านี้ไม่สามารถใช้งานร่วมกับ macOS 10.13 ขึ้นไปได้อีกต่อไป";
